{
  "personal": {
    "name": "Thayane Carvalho dos Santos",
    "title": "Desenvolvedora Front-End Angular | TypeScript, JavaScript, HTML, CSS, PostgreSQL, Firebase",
    "location": "Aracaju, Sergipe, Brasil",
    "contacts": {
      "phone": "+55 (79) 9 8119-0742",
      "email": "thayanecarvalho3@gmail.com",
      "linkedin": "linkedin.com/in/thayane-carvalho-developer/",
      "github": "github.com/Th2y"
    }
  },
  "objective": "Atuar como Desenvolvedora Front-End Angular, aplicando boas práticas de arquitetura, performance e UI/UX para construir interfaces modernas, escaláveis e acessíveis, contribuindo para a entrega de produtos digitais de alta qualidade e código limpo.",
  "summary": "Desenvolvedora Front-End com mais de 3 anos de experiência em Angular, especializada na criação de interfaces performáticas, responsivas e modulares.\nDomino HTML, CSS, TypeScript, JavaScript e Angular Material, com experiência em Tailwind, Firebase e PostgreSQL.\nAplico RxJS, lazy loading e code splitting para otimização de performance, mantendo foco em arquitetura escalável e experiência do usuário.\nPossuo sólida base Full-stack (Java + Angular + PostgreSQL) e experiência complementar em Unity (C#), unindo lógica, usabilidade e integração entre web e jogos.\nSou pós-graduada em Arquitetura e Desenvolvimento de Sistemas, com ênfase em Padrões de Projeto e Metodologias Ágeis, fortalecendo a visão arquitetural e o domínio técnico em aplicações modernas.",
  "experience": [
    {
      "title": "Desenvolvedora Angular Pleno e Unity",
      "company": "Horse Power Studio",
      "period": "05/2025 - Presente",
      "details": [
        "Desenvolvimento e manutenção de painel administrativo em Angular, integrando Supabase (PostgreSQL) para autenticação, CRUD completo e filtros dinâmicos de alta performance.",
        "Criação de componentes modulares, acessíveis e responsivos com Angular Material, SCSS e TailwindCSS, garantindo consistência visual e escalabilidade.",
        "Utilização avançada de RxJS para otimizar o fluxo de dados, encadear requisições e eliminar chamadas redundantes, melhorando o desempenho geral da aplicação.",
        "Implementação de estratégias de otimização, como lazy loading, code splitting e build refinado, reduzindo o tempo de carregamento e melhorando a experiência do usuário.",
        "Colaboração ativa em projetos de Unity com C#, aplicando princípios de interface interativa e lógica de jogo, reforçando integração entre front-end web e desenvolvimento de jogos.",
        "Deploy e versionamento contínuo via GitHub e Vercel, garantindo entregas rápidas e confiáveis em ambiente de produção."
      ],
      "icons": [
        "angular",
        "javascript",
        "typescript",
        "html",
        "css",
        "scss",
        "tailwindcss",
        "supabase",
        "postgresql",
        "csharp",
        "unity",
        "github",
        "vercel",
        "json"
      ]
    },
    {
      "title": "Desenvolvedora Angular",
      "company": "Freelancer",
      "period": "10/2022 - Presente",
      "details": [
        "Desenvolvimento de aplicações completas em Angular, integrando Firebase ou PostgreSQL para autenticação, armazenamento e gerenciamento de dados em tempo real.",
        "Criação de arquiteturas modulares e escaláveis com TypeScript, seguindo princípios SOLID e boas práticas de componentização e manutenção de código.",
        "Implementação de autenticação segura, controle de acesso por papéis e fluxos de login com Firebase Authentication ou Supabase Auth.",
        "Construção de interfaces responsivas e modernas com SCSS e TailwindCSS, garantindo excelente experiência do usuário em múltiplos dispositivos.",
        "Gerenciamento de versionamento e deploy contínuo com Git e Vercel, mantendo histórico limpo e entregas ágeis e organizadas."
      ],
      "icons": [
        "angular",
        "javascript",
        "typescript",
        "html",
        "css",
        "scss",
        "tailwindcss",
        "firebase",
        "supabase",
        "postgresql",
        "github",
        "vercel",
        "json"
      ]
    },
    {
      "title": "Analista de Desenvolvimento de Sistemas",
      "company": "Bluewolfbr",
      "period": "11/2020 - 02/2022",
      "details": [
        "Atuação full stack no desenvolvimento de sistemas corporativos, utilizando Angular no Front-end e Java (Spring Boot) no Cack-end, com integração via APIs REST.",
        "Implementação de interfaces responsivas e dinâmicas com HTML, SCSS e Bootstrap, otimizando a experiência do usuário e a performance das aplicações internas.",
        "Modelagem e documentação de APIs com Swagger, garantindo padronização e clareza na comunicação entre o Front-End e o Back-end.",
        "Integração de Firebase ou PostgreSQL para autenticação, persistência de dados e notificações em tempo real.",
        "Liderança temporária de equipe como Gerente de Projetos, coordenando desenvolvedores e entregando um app multiplataforma (Angular + Flutter + Java) em apenas 2 meses.",
        "Implantação e manutenção de aplicações em ambiente cloud com Heroku e versionamento contínuo com Git."
      ],
      "icons": [
        "angular",
        "javascript",
        "typescript",
        "html",
        "css",
        "scss",
        "java",
        "postgresql",
        "firebase",
        "swagger",
        "flutter",
        "bootstrap",
        "github",
        "heroku",
        "gimp",
        "json"
      ]
    },
    {
      "title": "Desenvolvimento de Jogos na Unity",
      "company": "Experiências Complementares",
      "period": "02/2022 - Presente",
      "details": [
        "Desenvolvimento de jogos e experiências interativas na Unity, com foco em usabilidade, performance e boas práticas de arquitetura de código em C#.",
        "Implementação e otimização de sistemas de interface (UI/UX), efeitos visuais e lógicas de gameplay reutilizáveis.",
        "Integração de módulos Java à build Android da Unity, desenvolvendo recursos nativos não suportados pela engine e garantindo compatibilidade com o ecossistema mobile.",
        "Utilização de Firebase ou PostgreSQL para autenticação, armazenamento de progresso e sincronização de dados em tempo real.",
        "Criação e edição de assets simples em 2D e 3D no Blender e GIMP, alinhando arte e programação de forma coesa.",
        "Versionamento de projetos e controle de entregas utilizando Git."
      ],
      "icons": [
        "unity",
        "csharp",
        "postgresql",
        "firebase",
        "github",
        "blender",
        "gimp",
        "java"
      ]
    }
  ],
  "education": [
    {
      "institution": "GRAN",
      "course": "Pós-graduação em Arquitetura e Desenvolvimento de Sistemas com Ênfase em Padrões de Projeto",
      "period": "05/2024 - 05/2025",
      "details": [
        "Formação voltada ao desenvolvimento de aplicações web modernas, com foco em Padrões de Projeto, Arquitetura de Software e Metodologias Ágeis.",
        "Abordagem prática em desenvolvimento Front-end (React, HTML, CSS, JavaScript, TypeScript) e Back-end em Java, reforçando a atuação Full-stack."
      ],
      "icons": [
        "react",
        "html",
        "css",
        "scss",
        "javascript",
        "typescript",
        "java",
        "github"
      ]
    },
    {
      "institution": "UNIT",
      "course": "Graduação em Jogos Digitais",
      "period": "01/2019 - 06/2021",
      "details": [
        "Formação com foco em programação, design e produção de jogos digitais, com ênfase em Unity e C#.",
        "Atuação como líder de equipe de programação e responsável pelo desenvolvimento e integração de sistemas de jogo e interfaces."
      ],
      "icons": [
        "unity",
        "csharp",
        "github",
        "blender",
        "gimp"
      ]
    }
  ],
  "languages": [
    {
      "name": "Português",
      "level": "Nativo",
      "level_number": 6
    },
    {
      "name": "Espanhol",
      "level": "Avançado (C1)",
      "level_number": 5
    },
    {
      "name": "Inglês",
      "level": "Intermediário (B2)",
      "level_number": 4
    }
  ],
  "courses": [
    "Formação Angular – Alura",
    "Formação Front-End – Alura",
    "Java e Clean Architecture – Alura",
    "Scrum Fundamentals – SCRUMstudy"
  ],
  "skills": {
    "languages": [
      {
        "name": "TypeScript",
        "years": 3
      },
      {
        "name": "JavaScript",
        "years": 3
      },
      {
        "name": "HTML",
        "years": 3
      },
      {
        "name": "CSS",
        "years": 3
      },
      {
        "name": "SCSS",
        "years": 3
      },
      {
        "name": "C#",
        "years": 5
      },
      {
        "name": "Java",
        "years": 1
      }
    ],
    "frameworks": [
      {
        "name": "Angular",
        "years": 3
      },
      {
        "name": "React",
        "years": 0.1
      },
      {
        "name": "Tailwind",
        "years": 0.3
      },
      {
        "name": "Bootstrap",
        "years": 1
      },
      {
        "name": "RxJS",
        "years": 2
      },
      {
        "name": "Rest API",
        "years": 3
      },
      {
        "name": "Unity",
        "years": 5
      },
      {
        "name": "UEFN",
        "years": 0.2
      },
      {
        "name": "Flutter",
        "years": 0.2
      }
    ],
    "databases": [
      {
        "name": "Firebase",
        "years": 3
      },
      {
        "name": "PostgreSQL",
        "years": 3
      }
    ],
    "tools": [
      {
        "name": "Git",
        "years": 5
      },
      {
        "name": "GitHub",
        "years": 5
      },
      {
        "name": "VS Code",
        "years": 5
      },
      {
        "name": "Figma",
        "years": 1
      },
      {
        "name": "Trello",
        "years": 5
      },
      {
        "name": "Miro",
        "years": 5
      },
      {
        "name": "Jira",
        "years": 1
      },
      {
        "name": "Slack",
        "years": 1
      },
      {
        "name": "ClickUp",
        "years": 1
      },
      {
        "name": "GIMP",
        "years": 5
      },
      {
        "name": "Blender",
        "years": 1
      }
    ],
    "metodologies": [
      {
        "name": "SCRUM",
        "years": 5
      },
      {
        "name": "Kanban",
        "years": 5
      },
      {
        "name": "Metodologia Ágil",
        "years": 5
      },
      {
        "name": "Padrões de projeto",
        "years": 5
      }
    ],
    "soft": [
      "Organização",
      "Trabalho em equipe",
      "Resolução de problemas",
      "Proatividade",
      "Adaptabilidade"
    ]
  },
  "activities": [
    "Mentora voluntária de programação na Women Game Jam 2021",
    "Top 10 Autismo Tech 2023 com o projeto PonTEA (Flutter)"
  ]
}
